app/controllers/plans_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."id" IN (1, 2, 3)
SELECT "daily_plans".* FROM "daily_plans" WHERE "daily_plans"."day" = ?  [["day", 14]]
SELECT  1 AS one FROM "user_activity_completions" WHERE "user_activity_completions"."user_id" IS NULL AND "user_activity_completions"."daily_plan_id" = 40 LIMIT ?  [["LIMIT", 1]]
---
  def show
    day = params[:id].to_i
    plans = DailyPlan.includes(:activity).where(day: day)

    render json: {
      day: day,
      activities: plans.map do |plan|
        {
          id: plan.activity.id,
          title: plan.activity.title,
          completed: UserActivityCompletion.exists?(
            user: current_user, daily_plan: plan
          )

SELECT  "daily_plans".* FROM "daily_plans" WHERE "daily_plans"."day" = ? AND "daily_plans"."activity_id" = ? LIMIT ?  [["day", 0], ["activity_id", 42], ["LIMIT", 1]]
INSERT INTO "user_activity_completions" ("user_id", "daily_plan_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["daily_plan_id", 90], ["created_at", "2025-05-21 19:08:41.514339"], ["updated_at", "2025-05-21 19:08:41.514339"]]
SELECT  "user_activity_completions".* FROM "user_activity_completions" WHERE "user_activity_completions"."user_id" IS NULL AND "user_activity_completions"."daily_plan_id" = 90 LIMIT ?  [["LIMIT", 1]]
UPDATE "user_activity_completions" SET "completed_at" = ?, "updated_at" = ? WHERE "user_activity_completions"."id" = ?  [["completed_at", "2025-05-21 19:08:41.522835"], ["updated_at", "2025-05-21 19:08:41.523298"], ["id", 1]]
---
  def complete_activity
    day = params[:day].to_i
    activity_id = params[:activity_id].to_i

    daily_plan = DailyPlan.find_by(day: day, activity_id: activity_id)
    return render json: { error: 'Activity not found' }, status: :not_found unless daily_plan

    completion = UserActivityCompletion.find_or_create_by!(
      user: current_user,
      daily_plan: daily_plan
    )
    completion.update(completed_at: Time.current)